test/cwmp_builder_SUITE_data/cwmp_DUStateChangeComplete.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:cwmp="urn:dslforum-org:cwmp-1-0"><soapenv:Header/><soapenv:Body><cwmp:DUStateChangeComplete><cwmp:OpResultStruct><DeploymentUnitUUID>uuid</DeploymentUnitUUID><DeploymentUnitRef>depl_unit</DeploymentUnitRef><Version>1</Version><DeploymentUnitState>on</DeploymentUnitState><Resolved>true</Resolved><ExecutionUnitRefList>ExecutionUnitRefList</ExecutionUnitRefList><StartTime>2012-10-03T18:53:34Z</StartTime><CompleteTime>2012-10-03T18:53:44Z</CompleteTime><cwmp:DeploymentUnitFaultStruct><FaultCode>9012</FaultCode><FaultString>fault</FaultString></cwmp:DeploymentUnitFaultStruct></cwmp:OpResultStruct><CommandKeyType/></cwmp:DUStateChangeComplete></soapenv:Body></soapenv:Envelope>